{
	"title": "Orbital Battleship",
	
	"instructions": {
		"selecting": "Let's choose the shipment plan",
		"filling": "Now fill the ships",
		"shooting": "Let's play!"
	},

	"info": {
		"selecting": {
			"m": "Select a cargo plan",
			"c": "Plans are identified by chemical elements"
		},

		"filling": {
			"m": "Fill the scheme",
			"c": "Depending on the mode, you can mark single items or whole ships"
		},

		"shooting": {
			"1": {
				"m": "Track the situation",
				"c": "The opponent uses a satellite for surveillance"
			},
			"2": {
				"m": "Reveal the opponent's placement",
				"c": "Use quantum numbers for a high-precision satellite image"
			},
			"3": {
				"m": "Identify the opponent's code",
				"c": "It is necessary to find out which cargo plan is used"
			}
		}
	},

	"status": {
		"choosing" : "choosing",
		"filling" : "filling",
		"moving" : "moving",
		"waiting" : "waiting"
 	},
	
	"labels": {
		"time": "time",
		"shots": "shots",
		"certainty": "certainty"
	},

	"actions": {
		"play" : "Play",
		"main" : "Back to main",
		"giveup" : "Give Up",
		"start" : "Start mission",
		"rematch" : "Rematch",
		"exit" : "Leave"
	},

	"components": {

		"loading" : "Loading",
		"captain" : "Captain",
		
		"table": {
			"code": "Shipment code",
			"enemy": "Opponent's code",
			"ammo": "Amount",
			"choose": "Select element",
			"guess": "Make a guess"
		},

		"filling": {
			"text": "Mode",
			"ships": "ships",
			"items": "items"
		},

		"mission": {
			"passed": "Mission passed",
			"failed": "Mission failed"
		}
	},

	"pages": {
		"landing": {
			"header": {
				"game": "Game",
				"rules": "Rules",
				"project": "Project"
			},
			"play": "Play",
			"educational": "Educational game in chemistry",
			"game": {
				"header": "It's not just a game",
				"subheader": "",
				"title-1": "Fixing the rules of Klechkovsky and Hund",
				"text-1": "Knowing the rules of chemistry is the key to victory",
				"title-2": "Demonstration of periodicity of elements",
				"text-2": "Both the game and the interactive simulator",
				"title-3": "Development of strategic skills",
				"text-3": "Develop your strategy to overtake the enemy",
				"title-4": "Increase motivation and concentration",
				"text-4": "Play, earn points and become a pro"
			},
			"rules": {
				"header": "How to play?",
				"subheader": "The same sea battle only with chemical elements",
				"action": "Read more",
				"1": {
					"title": "Element selection",
					"description": "Choose a loading plan - one of 118 chemical elements."
				},
				"2": {
					"title": "Diagram completion",
					"description": "Arrange the weights (electrons) according to the plan - the electronic configuration of the element."
				},
				"3": {
					"title": "Shot at the opponent's diagram",
					"description": "Battle: on the opponent's field, choose the electrons you want to \"shoot\" at by checking if there is an electron on that spot. Use the coordinates of the weights:\nn - the level of the electron cloud: 1, 2 and up to 7\nl - a specific ship in our game\nmL - a cell in the electron cloud, a place for cargo in the ship\nmS - electron spin or cargo position in the cell"
				},
				"4": {
					"title": "Finish",
					"description": "Take turns shooting at each other's electrons: if you shot at an electron that is present in your opponent's atom, it will glow red; if your electron is hit, it will glow white. During the turn it is allowed to either shoot your opponent's electron once, or to name your opponent's chemical element."
				},
				"5": {
					"title": "The goal",
					"description": "The goal of the game is to guess the opponent's chemical element.\nHave a good orbital battleship!"
				}
			},
			"project": {
				"header": "About the project",
				"from": "since",
				"year": "year",
				"implementation": "the project was introduced into the educational process in chemistry",
				"articles": "articles",
				"publishing": "in the leading scientific publication Journal of Chemical Education",
				"grants": "grants",
				"grants-goal": "dedicated to teaching chemistry in a VR environment",
				"version": "version",
				"presented": "successfully developed and presented at exhibitions"
			},
			"command": {
				"header": "Team",
				"name-1": "Mikhail Kurichin",
				"name-2": "Artem Smolin",
				"name-3": "Anastasia Rychkova",
				"name-4": "Asia Ermolaeva",
				"name-5": "Ilya Koshcheev",
				"name-6": "Angelina Malkiv"
			},
			"footer": {
				"domain": "Rules for the use of information in the itmo.ru domain zone",
				"copyright": "ITMO University"
			}
		},

		"404": {
			"title": "Error 404",
			"text": "Page not found",
			"construction": "Under construction"
		},

		"rules": {
			"paragraphs": [
				"Your assistant - the captain of the ship - will point out that at the beginning of the game you have to choose a loading plan - it is one of 118 chemical elements. Then you have to place the weights (which represent the electrons) according to the plan, i. e. to represent the electronic configuration of the chosen in the ground state on the electronic diagram which you will see in front of you. This diagram will become your \"battlefield\".",
				"The number of weights, i. e. electrons, is the ordinal number of the element. Filling the ship with weights, i. e. orbitals with electrons, happens according to chemical laws. In order to fill the diagram for player's chosen element, as well as to subsequently guess the element of the opponent, the player should be guided by several principles:",
				"**Kleczkowski’s (Madelung’s) rule**: this rule determines the order in which electrons fill atomic orbitals, and, according to it, electrons fill energy levels in order of increasing energy:",
				"**Hund’s rule**: according to this rule, each electron cloud (i. e., the ship in the game) is filled first with electrons with positive spin (arrows pointing up), and then are added with negative spin (arrows pointing down). This is due to the greatest total energy that is formed on a particular electron cloud - the ship in our game.",
				"By clicking on the arrows on the diagram you can change their state - if the arrow is white, then you have added weight to this ship. Remember that the number of cargoes corresponds to the number of the element in the Mendeleev table. At the bottom of the screen, you can choose the mode of filling - weights one by one or whole ships, by switching them you can fill the orbitals the way you want. If you fill in the electronic element chart correctly, the captain will inform you that the game has started. Your opponent is a program with the nickname \"Droid\", try to win the game!",
				"Next comes the \"battle\" stage: you will see your opponent's orbital chart (you can look at yours by clicking on the arrow in the middle of the screen on the left, or by switching the view in the box at the bottom of the screen). Also, at the bottom you see your shot control panel: to hit a particular weight you need to pinpoint its coordinates. In classical battleship game, these are letters and numbers, but here they are the values of four quantum numbers:",
				"**Players take turns shooting at each other's electrons**: if you shot at an electron that is present in your opponent's atom, it will glow red; if your electron is hit, it will glow white. You can either shoot your opponent's electron once during the move, or you can name your opponent's chemical element using the third view of the game by pressing the arrow in the middle of the screen on the right, or by switching the view in the box at the bottom of the screen - you will get the Mendeleev table where you can name your opponent's element and you can also check with it. If you can't guess an element and want to quit the game, press the \"Quit\" button - in this case you will automatically lose and return to the selection of your opponent.",
				"**The goal of the game is to be the first to guess the opponent's chemical element**. If you guessed correctly, you win, but if you did not have time to name the enemy element in your turn, or if you named it incorrectly, you lose the battle and see the message \"Mission Failed\" on the screen. Then you can play again in the first case and take revenge in the second to play again."
			],
			"definitions": {
				"n": "principal, determines the level of the electron cloud: 1, 2 and up to 7",
				"l": "azimuthal, defines the shape of the orbital, or a specific ship in our game",
				"m": "magnetic, defines a cell in the electron cloud, a place for weight in the ship",
				"s": "spin, determines the spin of the electron or the position of the cargo in the cell."
			},
			"caption": [
				"Orbital diagram with example filling for neon (order number 10).",
				"View of the game in the \"battle\" phase"
			],
			"end": "Have a great orbital battleship game!"
		}
	},

	"aliases": {
		"_ai" : "Droid",
		"mdl" : "Mendeleev",
		"gfm" : "Hofmann",
		"mrn" : "Moerner"
	},

	"periodic_table": [
		"",
		"Hydrogen",
		"Helium",
		"Lithium",
		"Beryllium",
		"Boron",
		"Carbon",
		"Nitrogen",
		"Oxygen",
		"Fluorine",
		"Neon",
		"Sodium",
		"Magnesium",
		"Aluminium",
		"Silicon",
		"Phosphorus",
		"Sulfur",
		"Chlorine",
		"Argon",
		"Potassium",
		"Calcium",
		"Scandium",
		"Titanium",
		"Vanadium",
		"Chromium",
		"Manganese",
		"Iron",
		"Cobalt",
		"Nickel",
		"Copper",
		"Zinc",
		"Gallium",
		"Germanium",
		"Arsenic",
		"Selenium",
		"Bromine",
		"Krypton",
		"Rubidium",
		"Strontium",
		"Yttrium",
		"Zirconium",
		"Niobium",
		"Molybdenum",
		"Technetium",
		"Ruthenium",
		"Rhodium",
		"Palladium",
		"Silver",
		"Cadmium",
		"Indium",
		"Tin",
		"Antimony",
		"Tellurium",
		"Iodine",
		"Xenon",
		"Caesium",
		"Barium",
		"Lanthanum",
		"Cerium",
		"Praseodymium",
		"Neodymium",
		"Promethium",
		"Samarium",
		"Europium",
		"Gadolinium",
		"Terbium",
		"Dysprosium",
		"Holmium",
		"Erbium",
		"Thulium",
		"Ytterbium",
		"Lutetium",
		"Hafnium",
		"Tantalum",
		"Tungsten",
		"Rhenium",
		"Osmium",
		"Iridium",
		"Platinum",
		"Gold",
		"Mercury",
		"Thallium",
		"Lead",
		"Bismuth",
		"Polonium",
		"Astatine",
		"Radon",
		"Francium",
		"Radium",
		"Actinium",
		"Thorium",
		"Protactinium",
		"Uranium",
		"Neptunium",
		"Plutonium",
		"Americium",
		"Curium",
		"Berkelium",
		"Californium",
		"Einsteinium",
		"Fermium",
		"Mendelevium",
		"Nobelium",
		"Lawrencium",
		"Rutherfordium",
		"Dubnium",
		"Seaborgium",
		"Bohrium",
		"Hassium",
		"Meitnerium",
		"Darmstadtium",
		"Roentgenium",
		"Copernicium",
		"Nihonium",
		"Flerovium",
		"Moscovium",
		"Livermorium",
		"Tennessine",
		"Oganesson"
	]
}